[
  "Most of life is a search for who and what needs you the most.",
  "No one is going to value you more than you value yourself.",
  "A busy calendar and a busy mind will destroy your ability to create anything great.",
  "You have one life. You’re dead for tens of billions of years, and you’re going to be dead for tens of billions of years.",
  "Happiness is a state where nothing is missing.",
  "Guard your time. It’s all you have.",
  "You do not want to compete, you want to be a market of one.",
  "The greatest superpower is the ability to change yourself.",
  "People spend too much time doing and not enough time thinking about what they should be doing.",
  "Earn with your mind, not your time.",
  "Most of modern life, all our diseases, are diseases of abundance, not diseases of scarcity.",
  "That’s the fundamental delusion – that there is something out there that will make you happy forever.",
  "As long as you can keep taking shots on goal, and you keep getting back up, eventually you’ll get through. Just stick at it.",
  "True happiness comes out of peace. Peace comes out of many things, but it comes from fundamentally understanding yourself.",
  "Nothing you do is going to matter that much in the long run. Don’t take yourself so seriously.",
  "If you could literally just sit for 30 minutes and be happy, you are successful.",
  "The modern mind is overstimulated and the modern body is understimulated and overfed. Meditation, exercise, and fasting restore an ancient balance.",
  "Guard your time. Forget the money.",
  "You should be too busy to do coffee while keeping an uncluttered calendar.",
  "Spend your time doing only what you can uniquely do.",
  "Become the best in the world at what you do. Keep redefining what you do until this is true.",
  "Meditation is intermittent fasting for the mind. Too much sugar leads to a heavy body, and too many distractions lead to a heavy mind. Time spent undistracted and alone, in self-examination, journaling, meditation, resolves the unresolved and takes us from mentally fat to fit.",
  "Work as hard as you can. Even though what you work on and who you work with are more important.",
  "Your goal in life is to find out the people who need you the most, to find out the business that needs you the most, to find the project and the art that needs you the most. There is something out there just for you.",
  "Most of our suffering comes from avoidance.",
  "In a billion dollar company, the employees aren’t working any harder than people in a million dollar company. They’re just doing the right things.",
  "A happy, calm, and peaceful person will make better decisions. So if you want to operate at peak performance, you have to learn how to tame your mind.",
  "We waste our time with short term thinking and busywork. Warren Buffett spends a year deciding and a day acting. That act lasts decades.",
  "Knowledge workers train, sprint, rest, and re-assess. Inspiration is perishable – act on it immediately. Be impatient with actions but patient with results.",
  "Cynicism is easy. Mimicry is easy. Optimistic contrarians are the rarest breed.",
  "School, politics, sports, and games train us to compete against others. True rewards — wealth, knowledge, love, fitness, and equanimity — come from ignoring others and improving ourselves.",
  "I don’t care how rich you are. I don’t care whether you’re a top Wall Street banker. If somebody has to tell you when to be at work, what to wear and how to behave, you’re not a free person. You’re not actually rich.",
  "Mentors won’t make you rich. Doctors won’t make you healthy. Nutritionists won’t make you slim. Teachers won’t make you smart. Gurus won’t make you calm. Trainers won’t make you fit. Ultimately, you have to take responsibility. Save yourself.",
  "When you’re healthy you have 10000 needs, but when you’re sick you only have one need.",
  "Sing the song that only you can sing, write the book that only you can write, build the product that only you can build… live the life that only you can live.",
  "You can escape competition through authenticity, when you realize that no one can compete with you on being you. That would have been useless advice pre-internet. Post-internet, you can turn that into a career.",
  "The modern struggle – Lone individuals summoning inhuman willpower, fasting, meditating, and exercising, up against armies of scientists and statisticians weaponizing abundant food, screens, and medicine into junk food, clickbait news, infinite porn, endless games and addictive drugs.",
  "You make your own luck if you stay at it long enough.",
  "Whatever the geeks are doing in their garage on weekends is what the entire earth will be doing 20 years later as a mainstream thing.",
  "Now the main source of capital is how many “robots”, programmers, and machines you have working for you. Those are the ultimate force multipliers.",
  "You have to put in the time, but more important is the judgment. The direction you’re heading in matters more than how fast you drive.",
  "The reality is life is a single-player game. You’re born alone. You’re going to die alone. All of your interpretations are alone. All your memories are alone. You’re gone in three generations and nobody cares. Before you showed up, nobody cared. It’s all single-player.",
  "You get paid for being right first, and to be first, you can’t wait for consensus.",
  "You’ll do better work if you’re bored rather than busy.",
  "The world doesn’t always give what you want, but it often gives you what you need.",
  "Learn to sell. Learn to build. If you can do both, you will be unstoppable.",
  "If you can’t see yourself working with someone for life, don’t work with them for a day.",
  "A fit body, a calm mind, a house full of love. These things cannot be bought — they must be earned.",
  "All the real benefits in life come from compound interest.",
  "The most important trick to be happy is to realize that happiness is a skill that you develop and a choice that you make. You choose to be happy, and then you work at it.",
  "You want to be rich and anonymous, not poor and famous.",
  "What you do, who you do with, and how you do it are way more important than how hard you work.",
  "Trade money for time, not time for money. You’re going to run out of time first.",
  "Arm yourself with specific knowledge.",
  "Play long-term games with long-term people. All returns in life, whether in wealth, relationships, or knowledge, come from compound interest.",
  "I would rather read the best hundred books over and over again until I absorb them rather than read every single book out there.",
  "The means of learning are abundant, it’s the desire to learn that’s scarce.",
  "I don’t plan. I’m not a planner. I prefer to live in the moment and be free and to flow and to be happy.",
  "The phrase that I use the most to myself in my head is I just tell myself one word: accept.",
  "I’m not afraid of death anymore. […] I don’t have the quest for immortality anymore.",
  "The first rule of handling conflict is don’t hang around people who are constantly engaging in conflict.",
  "The older the problem, the older the solution.",
  "Productize yourself.",
  "Less fear, more love.",
  "Slow down, life is long.",
  "Be present above all else.",
  "Be too busy to “do coffee”.",
  "Debate rather than dictate.",
  "Signaling virtue is a vice.",
  "Anything deep is interesting.",
  "Live below your means for freedom.",
  "Busy is the death of productivity.",
  "Desire is just fear by another name.",
  "To be honest, speak without identity.",
  "The heart decides, the head rationalizes.",
  "A lot of happiness is just being present.",
  "Eventually you will get what you deserve.",
  "Ruthlessly cut meetings out of your life.",
  "No matter how high your bar is, raise it.",
  "Relax, you’ll live longer and perform better.",
  "Live the life you want other people to live.",
  "Happiness is more about peace than it is about joy.",
  "Ideally you want to end up specializing in being you.",
  "No one in the world is going to beat you at being you.",
  "Good entrepreneurs don’t fail because they stay at it.",
  "Ego is false confidence, self-respect is true confidence.",
  "To a tree, there is no right or wrong. There is no good or bad.",
  "Only through suffering do you have change and self-improvement.",
  "Art is just creativity, it’s just anything done for its own sake.",
  "The people who succeed are irrationally passionate about something.",
  "Whether in commerce, science, or politics, history remembers the artists.",
  "To the experts, what looks like hard work from the outside, is play from the inside.",
  "If you have an unswerving desire to do something, then usually you’ll get it.",
  "If you want to operate at peak performance, you have to learn how to tame your mind.",
  "Pick your one overwhelming desire. It’s okay to suffer over that one. But on all the other desires, let them go so you can be calm and peaceful and relaxed.",
  "You’re better off following your genuine intellectual curiosity rather than chasing whatever is hot right now.",
  "The most successful entrepreneurs are authentic to who they are and what they uniquely can do.",
  "All of the really successful people I know have a really strong action bias. They just do things.",
  "I want to see truth. I want to see the world the way it is. Not through my filters. Not through my desires. Not through the way that other people want me to see it. And I want to accept it the way it is.",
  "Today in society you get rewarded for creative work, for creating something brand new that society didn’t even know that it wanted that it doesn’t yet know how to get, other than through you.",
  "The best way to prepare for the future 20 years is find something you love to do, to have a shot at being one of the best people in the world at it. Build an independent brand around it, with your name, not a company’s name or other people’s names around it. Try to make a creative work, so you’ll stay interesting, stay ahead of the game.",
  "Figure out what you’re good at and start helping other people with it; give it away. Pay it forward. Karma sort of works because people are very consistent. On a long enough timescale, you will attract what you project.",
  "A contrarian isn’t one who always objects – that’s a conformist of a different sort. A contrarian reasons independently, from the ground up, and resists pressure to conform.",
  "All the great endeavors in life are creative.",
  "Asymmetric opportunities: Invest in startups. Start a company. Create a book, podcast, video. Create a (software) product. Go on many first dates. Go to a cocktail party. Read a Lindy book. Move to a big city. Buy Bitcoin. Tweet.",
  "Once you’ve truly controlled your own fate, for better or for worse, you’ll never let anyone else tell you what to do.",
  "The way to retire is actually to find the thing that you know how to do better than anybody. And you know how to do it better than anybody because you love to do it. No one can compete with you if you love to do it. Be authentic and then figure out how to map that to what society actually wants, apply some leverage, put your name on it so you take the risks but you gain the rewards, have ownership and equity in what you do, and then just crank it out.",
  "We all get shaped by adversity. All the great things that have happened to me in my life that I consider highly positive… they all started with something highly negative.",
  "Being a founder is brutally difficult. It takes a long time and in the long run, the people who succeed are just the ones who persevere.",
  "On who he considers successful: to me the real winners are the ones who step out of the game entirely, who don’t even play the game; who rise above it. Those are the people who have such internal mental and self control and self awareness that they need nothing from anybody else.",
  "No one can compete with you on being you, no one can compete with me on being me, so when I think about what my profession, what my job, what my work is, it’s just being me.",
  "You’re meant to do something. You’re not just meant to lie there in the sand and meditate all day long. You should self-actualize. You should do what you are meant to do.",
  "The best way, perhaps the only way, to change others is to become an example.",
  "If it entertains you now but will bore you someday, it’s a distraction. Keep looking.",
  "‘Consensus’ is just another way of saying ‘average’.",
  "We are going from bread and circuses to cannabis and video games to psychedelics and VR.",
  "Politics is the exercise of power without merit.",
  "A good conference is a vacation that you take with really smart friends.",
  "If you can’t delete an email without flinching or responding, you won’t scale.",
  "Politics is sports writ large — pick a side, rally the tribe, exchange stories confirming bias, hurl insults and threats at the other side.",
  "It is the mark of a charlatan to explain a simple concept in a complex way.",
  "On meditation: It’s self-therapy. Instead of paying a therapist to sit there and listen to you, you’re listening to yourself.",
  "We’re basically monkeys on a small rock orbiting a small backwards star in a huge galaxy, which is in an absolutely staggeringly gigantic universe, which itself may be part of a gigantic multiverse.",
  "A vacation is a very expensive way to schedule the time to read a book in peace.",
  "Given that the main function of universities these days is filtering and signaling, the best move is to get admitted to Stanford and then drop out.",
  "People who try to look smart by pointing out obvious exceptions actually signal the opposite.",
  "Develop ‘strategic incompetence’ – people won’t ask you to do things you hate to do, if you’re bad at them.",
  "If you’re smart, you should be able to figure out how to be happy. Otherwise, you’re not that smart.",
  "Twitter is television for intellectuals.",
  "More drugs are taken to quiet the mind than to heal the body.",
  "Guilt is society’s voice speaking in your head.",
  "Self-image is the prison. Other people are the guards.",
  "On what he wants to be remembered for: I don’t care. I’ll be dead.",
  "We are biological machines programmed to survive and replicate. Happy is anti-evolution.",
  "Is it so important to me that I be unhappy unless this goes my way?",
  "If raising children was less rewarding than not doing it, the human race would have gone extinct.",
  "When you look at the greatest artists and creators, they have this ability to start over that nobody else does.",
  "You have social statisticians, scientists, and researchers in lab coats, literally the best minds of our generation figuring out how to addict you to the news. And if you fall for it, if you get addicted. your brain will get destroyed.",
  "Suffering is a moment of clarity, when you can no longer deny the truth of a situation and are forced into uncomfortable change. Inside suffering is the seed of change.",
  "Humans are always signaling. Rather than really looking at yourself, you’re looking at how other people look at you.",
  "It’s kind of a disease – social media is making celebrities of all of us and celebrities are the most miserable people in the world.",
  "Modern society will shame you for earning money, shame you for being happy, shame you for being raised well, shame you for having children, and ultimately, shame you for existing. It isn’t just religion that controls you by declaring you a sinner.",
  "Reality is neutral. Reality has no judgments. To a tree, there’s no concept of right or wrong or good or bad. You’re born, you have a whole set of sensory experiences… and then you die. How you choose to interpret that is up to you. And you do have that choice.",
  "If you eat, invest, and think according to what the ‘news’ advocates, you’ll end up nutritionally, financially and morally bankrupt.",
  "The most powerful people in the world today are the people who are writing the algorithms for Twitter, Facebook, and Instagram because they’re controlling the spread of information. They’re programming the culture.",
  "Involve groups in the creative process and you inevitably end up with a pile of pleasing, socially-acceptable lies. Contrast blockbuster movies with the great books.",
  "The fundamental insecurity – most people need faith in something – religion, government, academia. Few are comfortable with decentralized systems.",
  "We’re used to constantly judging things. The act of judging something separates you from that thing. Over time, as you judge, judge, judge, you invariably judge people. You judge yourself. You separate yourself from everything, and then you end up lonely. That feeling of disconnection, loneliness, is eventually what leads to suffering.",
  "Judgment allows us to move through the world, but it’s also what separates us from one another. If I’m judging my friends and family, I’m separating myself from them. I’m creating a gap between us by putting them down and propping myself up.",
  "The universe has been around for a long time, and the universe is a very, very large place. If you’ll study even the smallest bit of science, for all practical purposes we are nothing. We are ameba. We are bacteria to the universe.",
  "This universe has been around probably for 10 billion years or more, and will be around for tens of billions of years afterwards. Your existence, my existence is just infinitesimal. It’s like a firefly blinking once in the night.",
  "When you’re on your death bed, when you’re on your last day, you’d give up every dollar in the bank for a few days, another hour, another minute.",
  "We don’t always get what we want, but sometimes what is happening is for the best. The sooner you can accept it as a reality, the sooner you can adapt to it.",
  "I do everything for me. I don’t do anything for other people. None of us do. I think we all like to pretend like we’re doing everything for other people, but the reality is, we’re always just doing it for ourselves. That’s just the truth, and so whenever people ask me why did I do X or Y or Z, it’s always for me; that’s why I did it.",
  "I kind of feel like every moment is a death. You can’t go back to the past; no one’s ever gone back even a second. I don’t even remember what I said two minutes ago.",
  "All that exists is this moment; it’s all there is. There is no future. That’s a fiction in your head that… nobody can predict the future. There is no past; nobody’s gone back even an inch in their past, not even a second, so that doesn’t exist.",
  "Literally all that exists is this moment. I feel like you’re dying and being reborn at every moment. It’s just, it’s up to you to choose whether to forget it or to remember it.",
  "We feel guilt when we no longer want to associate with old friends and colleagues who haven’t changed. The price, and marker, of growth.",
  "The reality is you’ve been dead for the history of the universe, it’s 10 billion years or more. You will be dead for the next 70 billion years or so until the heat death of universe.",
  "Anything you do will fade. It will disappear, just like the human race will disappear and the planet will disappear. Get to Mars, even that group will disappear. No one is going to remember you past a certain number of generations, whether you’re an artist or a poet or a conqueror or a pauper or nothing. There’s no meaning.",
  "My biggest fear is that I’m going to die without having really lived. I think everybody has that fear at some core level.",
  "Everyone that ends up becoming an extreme winner in society starts off as a loser.",
  "I don’t know if this generation is the last mortal generation, or the last one before we blow ourselves up.",
  "We are evolved for frequent, visible, small wins and to ignore the infrequent, hidden, catastrophic risks.",
  "Be like family to your friends, a friend to strangers, and a stranger to your enemies.",
  "Large groups are no place for smart people.",
  "All greatness comes from suffering.",
  "The best exercise is the one your enjoy doing every day.",
  "If you want to see who rules over you, see who you’re not allowed to criticize.",
  "Better motivated on the wrong thing than unmotivated on the right thing.",
  "Picking the direction that you’re heading in in every decision is far, far more important than what force you apply. Just pick the right direction to start walking in, and then start walking.",
  "The biggest mistake any performer can make is to look at the audience.",
  "Your real resumé is a painful recounting of all of your struggles.",
  "When it comes to medicine and nutrition, subtract before you add.",
  "To measure the quality of your life, simply do nothing, and see how it feels.",
  "It’s a contradiction that we all deal with. That we all want to be successful people, but we also want to be happy people. The two of those run in almost diametric opposites to each other.",
  "My definition of wisdom is knowing the long term consequences of your actions.",
  "The people with the best judgment are among the least emotional.",
  "Do everything you were going to do, but with less angst, less suffering, less emotion. Everything takes time.",
  "I think almost everything about humans and human civilization is explained better by evolution than anything else.",
  "I think it just helps to be very aware that fundamentally, there are no adults. Everyone is making it up as they go along. You have to find your own path, picking, choosing, taking and discarding as you see fit.",
  "The best relationships are peer relationships. When given power over others, our ego justifies it by assuming we are smarter. Better to have people work with us than for us.",
  "Think clearly from the ground up. Understand and explain from first principles. Ignore society and politics. Acknowledge what you have. Control your emotions. (Related: stoicism)",
  "Don’t return it, give it away. Don’t keep fixing it, create something new. Don’t force the relationship, find someone else.",
  "If you want to be successful, surround yourself with people who are more successful than you are. If you want to be happy, surround yourself with people who are less successful.",
  "Knowledge is discovered by all of us, each adding to the whole. Wisdom is rediscovered by each of us, one at a time.",
  "My 50-year-old self is going to say chill out, relax, don’t stress so much, live in the moment. It will all be all right.",
  "You always have three options. You can change it, you can accept it, or you can leave it.",
  "You realize just how precious life is and how it’s important to make sure that you enjoy yourself, you sleep well at night, you’re a good moral person, you’re generally happy, you take care of other people, you help out, but you can’t take it too seriously.",
  "Just focus on the one or two really really important things, and everything else, just surrender to it. Just take it as it comes. Just accept it. Be glad with it. Be happy that you’re in this world.",
  "Anger is a loss of control over the situation, and it is a contract that you’re making with yourself — that you’re going to literally be in physical and mental and emotional turmoil.",
  "Morality and ethics automatically emerge when we realize the long term consequences of our actions.",
  "In general, avoid getting into situations where you’re sacrificing today for an imagined tomorrow.",
  "All real success is internal and has very little to do with external circumstances.",
  "When I look back on my life, I want to say I saw the world the way it was.",
  "I can give glib answers all day long, but you have to discover your own personal answer.",
  "The flavor of life is on the edge.",
  "You have to do hard things to create your own meaning in life.",
  "The three big ones in life are wealth, health, and happiness. We pursue them in that order but their importance is in the reverse.",
  "My number one priority in life, above my happiness, above my family, above my work, is my own health. It starts with my physical health. Second, it’s my mental health. Third, it’s my spiritual health. Then it’s my family’s health.",
  "On what is the purpose of life: To keep growing and learning in the short period of time that you have. To seek truth and to accept things the way they are. To see the world the way it really is. Then, just to live your life. I think that’s it. Any deeper meanings or goals just lead to ideologies, which lead to desires, and belief systems, and disappointments and conflict.",
  "If you look back at your life on your deathbed at all the interesting things you’ve done, they’re all going to be centered around the sacrifices you’ve made and the hard things that you did.",
  "We are overexposed to everything. The way to survive in modern society is to be an ascetic, it is to retreat from society. There’s too much society everywhere you go. You have society in your phone, society in your pocket, society in your ears… It’s socializing you and programming everyone. The only solution is turn it off.",
  "Humans are basically habit machines […] I think learning how to break habits is actually a very important meta skill and can serve you in life almost better than anything else.",
  "When building habits, choose consistency over content. The best book is the one you can’t put down. The best exercise is the one you enjoy doing every day. The best health food is the one you find tasty. The best work is the work you’d do for free.",
  "Don’t do things that you know are morally wrong. Not because someone is watching, but because you are. Self-esteem is just the reputation that you have with yourself.",
  "When looking for a purpose to life, notice that most things are stepping stones, done for ulterior motives. True art, love, and play stand apart, as they are done for their own sakes.",
  "The more you judge people and things, the more you’re going to separate yourself. You’ll feel good for an instant… but then you’re gonna feel lonely and then you’re just going to see negativity everywhere. The world just reflects your own feelings back at you.",
  "All humans are meant to do something different every day. The idea that we repeat ourselves and we specialize and we pigeon hole ourselves is a modern invention created through specialization of labor in the industrial revolution.",
  "A great goal in life would be to not have to be in a given place at a given time… Being accountable for your output rather than your input. I would love to be paid purely for my judgment.",
  "On the meaning of life: You get to make up your own answer and that’s the beauty of it. If there was a single answer, we wouldn’t be free. We’d be trapped because we’d all have to live to that answer. We’d be robots competing with each other trying to fulfill that meaning more than the next person.",
  "If you’re going to pick 3 cards in the hand you’re dealt, take intelligence, drive, and most importantly, emotional self-discipline.",
  "A personal metric: how much of the day is spent doing things out of obligation rather than out of interest?",
  "Stop caring about the impact and just be the best version of you possible – then you’ll naturally have an impact.",
  "I think happiness is a skill, nutrition is a skill, diet is a skill, investing is a skill, self awareness is a skill. And skills get built up over decades with feedback loops and you just have to constantly keep working on it.",
  "There’s no certainty in life. You can put in the hours, you can put in the time, but you can’t really expect the outcome.",
  "You have to be pretty ruthless about saying no to things, about turning people down, and about leaving room in your life for serendipity. If you don’t make time for people when they’re requesting time for you, yes it’s a little painful, it’s a little socially awkward, but the people aren’t going to disrespect you. If anything they want to hang out with you even more, because they realize you’re very discriminating with your time.",
  "On his morning routines: 1 hour meditation + 1 hour workout/yoga.",
  "It’s easier to change yourself than to change the world.",
  "We’re genetically wired to be pessimists, but modern society is far, far safer.",
  "It made sense to be pessimistic in the past, but it makes sense to be an optimist today.",
  "We just play games in life. You grow up, you’re playing the school game, you’re playing the social game. Then you’re playing the money game; then you’re playing the status game. These games just have longer and longer and longer-lived horizons. At some point, at least I believe that these are all just games. There are games where the outcome really stops mattering once you see through a game.",
  "Your closest friends are the ones you can have a relationship with about nothing.",
  "Everything you’re a winner at now in your life, you were a once a loser at.",
  "I wish I had done all of the same things but with less emotion and less anger.",
  "I don’t think life is that hard. I think we make it hard.",
  "To me happiness is not about positive thoughts. It’s not about negative thoughts. It’s about the absence of desire, especially the absence of desire for external things.",
  "Desire is a contract that you make with yourself to be unhappy until you get what you want.",
  "You can neither give happiness, nor receive it.",
  "A rational person can find peace by cultivating indifference to things outside of their control.",
  "Real happiness only comes as a side-effect of peace. Most of it is going to come from acceptance, not from changing your external environment.",
  "I, and I alone, am responsible for everything I think and feel.",
  "I don’t have a preconception of a perfect day, because if I did, then it would ruin the day that I was living.",
  "As you get older, you just realize that there’s no happiness in material possessions.",
  "I think a lot of us learn as we get older that happiness is internal.",
  "Yoga cultivates Peace of Body. Meditation cultivates Peace of Mind.",
  "Internal happiness is reward from being in flow. Create, meditate, love, play. Clears the mind and leaves us in peace.",
  "Happiness is an internal trait that comes out of being peaceful and accepting of whatever is going on around you. It’s that sense that nothing is missing in this moment.",
  "We are born with happiness, we are intrinsically happy creatures but we become unhappy because our egos create desire. The desire pulls us out of the moment. So something is missing right now then we chase that and we wonder why we are unhappy.",
  "The success driven mentality drives you to unhappiness.",
  "Every moment has to be complete in and of itself.",
  "You can very slowly but steadily and methodically improve your happiness baseline, just like you can improve your fitness.",
  "First time you saw a sunset, it was amazing. It was jaw-dropping. You forgot yourself. The second time you saw it, it was cool. The hundredth time you see it, it’s nothing. The thousandth time you’re seeing it, and someone shows you a sunset, you’re like, “Well, actually, I saw this one sunset in Mexico at this time that was really cool.” You’re not even there.",
  "Happiness is that state when nothing is missing. When nothing is missing, your mind shuts down and your mind stops running into the future or running into the past to regret something or to plan something.",
  "If you’re a peaceful person, anything you do will be a happy activity.",
  "Happiness to me is mainly not suffering, not desiring, not thinking too much about the future or the past, really embracing the present moment and the reality of what is, the way it is.",
  "Caught in a funk? Use meditation, music, and exercise to reset your mood. Then choose a new path to commit emotional energy for rest of day.",
  "To me, peace is happiness at rest and happiness is peace in motion. You can convert peace to happiness anytime you want.",
  "In today’s day and age, many people think you get peace by resolving all your external problems, but there are unlimited external problems. The only way to actually get peace on the inside is by giving up the idea of having problems.",
  "In every moment, in everything that happens, you can look on the bright side of something. There are two ways of seeing almost everything.",
  "The most important trick to be happy is to realize that happiness is a choice that you make and a skill that you develop. You choose to be happy, and then you work at it. It’s just like building muscles.",
  "I like to stay free because then I can see the little miracles in life. There are little miracles everywhere; it’s just we have taken them for granted.",
  "The problem happens when we have multiple desires. When we have fuzzy desires. When we want to do ten different things and we’re not clear about which is the one we care about.",
  "You don’t want to be the guy who succeeds in life while being high-strung, high-stress, and unhappy while leaving a trail of emotional wreckage for you and your loved ones.",
  "On meditation: Sit down, close your eyes, get in a comfortable position, and whatever happens, happens. If you think, you think. If you don’t think, you don’t think. Don’t put any effort into it.",
  "I need 4-5 hours of time by myself every day doing nothing. Because if I don’t have that time, I won’t be able to do anything.",
  "You have to work on your internal state until you are free of as many biases and conditioned responses as possible. This will improve every aspect of your life.",
  "Enlightenment is the space between your thoughts. It isn’t this thing you achieve after 30 years of sitting in a corner meditating. It’s something you can achieve moment to moment and you can be a certain percentage enlightened every single day.",
  "People who live far below their means enjoy a freedom that people busy upgrading their lifestyles can’t fathom.",
  "Quick relaxation hack: “Drop face, soft belly”. The face is usually wearing a mask to signal to others. The belly is often chronically tensed in a fight-or-flight response.",
  "Children are happy because: 1) They’re not self conscious 2) They lack a sense of time pressure 3) They’ve no goals. The bottom line is they are living from moment to moment, and the mind is not there to interfere in their bliss.",
  "I think a lot of what we think of happiness is is just pleasure. It’s physical pleasure, either from, “Oh, that tasted good”. Or it might be momentary pleasure from, “He loves me, she loves me”.",
  "I actually think happiness is the absence of suffering. It comes from peace, and that comes from being very careful about that desire, judgment, reaction. Realizing that you don’t actually need something anymore. That something is not important to you.",
  "On how to deal with anxiety: I remember that I’m going to die — memento mori, as they say. It’s hard, though. Anxiety is the human condition. It’s probably the single most pervasive emotion. I don’t think people understand how deep anxiety runs. If I conquered anxiety, I’d be the Buddha; so would you if you conquered anxiety.",
  "You should realize that this is such a short and precious life that it’s really important that you don’t spend it being unhappy. There’s no excuse for spending most of your life in misery. You’ve only got 70 years out of the 50 billion or so that the universe is going to be around.",
  "The fact that you can listen to this podcast on an iPhone or whatever you’re listening to it on mans you’re already better off than a lot of people.",
  "To live in the present moment is the highest calling. It’s the source of all happiness.",
  "It’s a bad habit that we develop that we forget how to appreciate what we do have.",
  "I’m not a busy person and I’m not busy because I refuse to schedule things.",
  "If you try to micromanage yourself all you’re going to do is make yourself miserable.",
  "Knowing how little you matter is very important for your own mental health and happiness.",
  "Uncertainty, not outcome, is the root of stress.",
  "I think to have peace of mind, you have to have peace of body, first.",
  "Looking forward to holidays takes the joy out of everyday.",
  "You won’t get rich renting out your time.",
  "Escape competition through authenticity.",
  "Money will solve all your money problems but it doesn’t get you everywhere.",
  "You just realize as you get older that it matters less and less and less.",
  "Apply specific knowledge, with leverage, and eventually you will get what you deserve.",
  "If you can’t code, write books and blogs, record videos and podcasts.",
  "Having a million-dollar net worth doesn’t make you a genius, and having less than a million-dollar net worth doesn’t make you a fool.",
  "Arm yourself with specific knowledge, accountability, and leverage. Specific knowledge is knowledge that you cannot be trained for. If society can train you, it can train someone else, and replace you.",
  "Specific knowledge can be taught through apprenticeships or self-taught. It’s high paying because society has not yet figured out how to teach or automate it. It tends to be creative or technical.",
  "You will get rich by giving society what it wants but does not yet know how to get. At scale.",
  "By the time people realize that they have enough money, they’ve lost their time and their health.",
  "The ultimate purpose of money is so that you do not have to be in a specific place at a specific time doing anything you don’t want to do.",
  "In almost any salaried job, even at one that’s paying a lot per hour like a lawyer, or a doctor, you’re still putting in the hours, and every hour you get paid. So, what that means is when you’re sleeping, you’re not earning. When you’re retired, you’re not earning. When you’re on vacation, you’re not earning. And you can’t earn non-linearly.",
  "There are no get-rich-quick schemes. That’s just somebody else trying to get rich off of you.",
  "Set and enforce an aspirational hourly rate. If fixing a problem will save less than your rate, ignore it. If outsourcing a task will cost less than your rate, outsource it. Get comfortable disappointing people whose expectations will eat your life up, one hour at a time.",
  "You can spend your life however you want, but if you want to get rich, it has to be your number one overwhelming desire.",
  "You retire by saving up enough money, becoming a monk, or by finding work that feels like play to you.",
  "I learned how to make money because it was a necessity. After it stopped being a necessity, I stopped caring about it.",
  "The first thing you realize when you make a bunch of money is that you’re still the same person.",
  "Seek wealth, not money or status.",
  "Wealth is assets that earn while you sleep.",
  "Wealth creation is an evolutionarily recent positive-sum game. Status is an old zero-sum game. Those attacking wealth creation are often just seeking status.",
  "Investing favors the dispassionate. Markets efficiently separate emotional investors from their money.",
  "The reason you want wealth is because it buys you your freedom. So, you don’t have to wear a tie like a collar around your neck. So, you don’t have to wake up at 7:00 AM, and rush to work, and sit in commute traffic. So, you don’t have to waste away your entire life grinding all your productive hours away into a soulless job that doesn’t fulfill you.",
  "The purpose of wealth is freedom. It’s nothing more than that. It’s not to buy fur coats, or drive Ferraris, or sail yachts, or jet around the world in your Gulfstream. That stuff gets really boring and really stupid, really fast.",
  "The more worldly success you have, the more your ego gets built up. The more fearful you might be of losing it all. The more fearful my might be about what other people think. The more you have to lose. The more you get caught up in this dream of who you think you are. I think worldly success actually hurts.",
  "Ignore people playing status games. They gain status by attacking people playing wealth creation games.",
  "We can all be wealthy, all of us.",
  "The best work is the work you’d do for free.",
  "Work becomes flow at the limits of ability.",
  "A taste of freedom can make you unemployable.",
  "The secret to public speaking is to speak as if you were alone.",
  "Solve via iteration. Then get paid via repetition.",
  "Partner with rational optimists.",
  "Self-awareness is the most attractive trait.",
  "Give society what it doesn’t how how to get.",
  "Organization is the enemy of innovation.",
  "In well-functioning teams, each individual has high accountability for their part.",
  "In an older society with few resources and mechanical work, the scheduled life is the most productive. In a modern society with permissionless leverage and creative work, the unscheduled life is the most productive.",
  "You’re never going to be the best in the world at anything unless it’s something that you just absolutely love to do.",
  "Meetings should really be phone calls, phone call should be emails, and phone calls should just be texts.",
  "Be present. Be meditative. Form real friendships. Stay away from business networking events or friendships where there is always an underlying business angle.",
  "Surround yourself with the best people possible. If there’s someone greater out there to work with, go work with them.",
  "Forty hour workweeks are a relic of the Industrial Age. Knowledge workers function like athletes — train and sprint, then rest and reassess.",
  "Generally, most people will make the mistake of paying too much attention to the competition and being too much like the competition and not being authentic enough.",
  "A small band of deeply committed believers will spread a story better than a horde of the lightly committed. True for religion, reputation, brand, currency, politics.",
  "At heart I’m an entrepreneur and any day in which I solve the same problem twice in a row, I’m pretty unhappy. So by definition, I like to do something different every day. I think all humans are sort of meant to do that kind of thing.",
  "Any meeting with eight people sitting around at a conference table, nothing is getting done in that meeting. You are literally just dying one hour at a time.",
  "At the end of the day, we’re all founders. We’re all meant to work for ourselves. We’re not meant to go to nine to five jobs and be told what to do over and over.",
  "Unnecessary meetings (and most are) are a mutually-assured-destruction of time. Learning how to avoid them is a prerequisite of doing anything great.",
  "Networking is overrated. Become first and foremost a person of value and the network will be available whenever you need it.",
  "It’s only after you’re bored that you have the great ideas. It’s never going to be when you’re stressed, or busy, running around or rushed. Make the time.",
  "A lot of people think you can go to school and you can study for how to make money, but the reality is, there’s no skill called “business”.",
  "The best founders I’ve found are the ones who are very long-term thinkers. Even decisions that maybe they shouldn’t care that much about early on, they fix it because they are not building a house, they’re putting bricks in the foundation of the skyscraper, at least in their minds.",
  "My number one predictor of whether or not a company will find product-market fit: High shipping cadence.",
  "Keep an incredibly high bar for who you work with.",
  "Behind every successful entrepreneur is a former failed self.",
  "Leverage is critical. Leverage; Archimedes famously said, “Give me a lever long enough and a place to stand and I will move the earth”.",
  "There are three broad classes of leverage (labor, capital, and no marginal cost of replication).",
  "The modern age is an age of leverage. We’re leveraged through machines, we’re leveraged through media, we’re leveraged through money, we’re leveraged through people working with us.",
  "A leveraged worker can out-produce a non-leveraged worker by a factor of 1000 or 10,000.",
  "We are now living in an age of nearly infinite leverage, and all the great fortunes are created through leverage. Your first job is to go and obtain leverage, and you can obtain leverage through permission by getting people to work for you, or by raising capital. Or you can get leverage permissionlessly by learning how to code or becoming good communicator and podcasting, broadcasting, creating videos, writing, etc.",
  "As a worker you want to be as leveraged as possible so that your work has a huge impact and it won’t take as much of your time or physical effort. Like you’d rather work with a bulldozer than work with your hands, the same way you’d rather work a computer than you would with a pencil.",
  "In an age of infinite leverage, judgement is the most important skill.",
  "With a leveraged worker, the choice of how they make the decision is far more important, their judgment is far more important than how much time they put in or how hard they worked.",
  "A good software engineer, just by writing the right little piece of code and creating the right little application, can literally create half a billion dollars’ worth of value for a company. But 10 engineers working 10 times as hard, just because they choose the wrong model or the wrong product, or wrote it the wrong way or put in the wrong viral loop or what have you, they basically wasted their time.",
  "The maximum leverage would mean that you would have people working for you. It would mean you would have a funding, you would have capital. It would mean that you’d be writing a book, it would mean that you’d be writing code and that you’d be building a media presence.",
  "Code and media are permissionless leverage. They’re the leverage behind the newly rich. You can create software and media that works for you while you sleep.",
  "Embrace accountability, and take business risks under your own name. Society will reward you with responsibility, equity, and leverage.",
  "In an age of permissionless leverage, judgement, not work, determines success and failure. Good judgement is the product of a calm and curious mind, reasoning without motivation and attachment. Whatever strengthens your ego weakens your judgement, and ultimately, your success.",
  "Media travels and earns while you sleep. It searches the world for opportunities for you. Code is even better.",
  "The robot army is already here – code lets you tell them what to do.",
  "On the Internet, a single individual can accomplish anything.",
  "The modern world is a gift. It gives us tools and choices, but we need the self-discipline and wisdom to choose wisely.",
  "Technology is not only the thing that moves the human race forward, but it’s the only thing that ever has. Without technology, we’re just monkeys playing in the dirt.",
  "In the digital world, the upside is so large that there’s almost no such thing as risk.",
  "Building technology means you don’t have to choose between practicing science, commerce, and art.",
  "Notifications are just alarm clocks that someone else is setting for you.",
  "If they can train you to do it, then eventually they will train a computer to do it.",
  "Things like Twitter and Facebook are not making you happy. They are making you unhappy. You are essentially playing a game that’s created by the creators of those systems, and yes, it can be a useful game once in a blue moon. You are engaging in envy, dispute, and resentment, comparison, jealousy, anger, about things that frankly just don’t matter.",
  "The human brain is not designed to absorb all of the world’s breaking news and 24/7 emergencies, injected straight into the skull with clickbait headlines. If you pay attention to that stuff, even if you have a sound mind and body, it will eventually drive you insane.",
  "I think long-term, Bitcoin is a currency of the Internet. So, even if humans don’t use it, routers will use it. Web browsers will use it. Web servers will use it.",
  "Think of Bitcoin as a bank account in the cloud, and it’s completely decentralized: not the Swiss government, not the American government. It’s all the participants in the network enforcing.",
  "Bitcoin is an exit from the Fed. DeFi is an exit from Wall Street. Social media is an exit from mass media. Homeschooling is an exit from industrial education. Remote work is an exit from 9-5. Creator economy is an exit from employment. Individuals are leaving institutions.",
  "I think of Twitter as the place where I go to have a great conversation when I can’t have one locally, which seems to be all the time, and the more time that I spend on Twitter, the more I sort of curate this incredible group of very intelligent people that I just get to know purely through the quality of their thoughts.",
  "Creativity is the last frontier. Automation over a long enough period of time will replace every non-creative job. That’s great news. That means that all of our basic needs are taken of, and what remains for us is to be creative, which is really what every human wants.",
  "Perhaps this time is different, automation will permanently destroy jobs, and humanity is incapable of relearning and doing creative work. Perhaps it’s time to drop the tyranny of low expections, and new tools will liberate individuals from a lifetime of drudgery, as they always have.",
  "I think long-term and on a long enough time scale, maybe it’s 50 years from now or maybe it’s 500 years from now, almost everybody on this planet will work for themselves.",
  "Technology is the application of knowledge to control the natural world. It’s the greatest driver of both human prosperity and our capacity for self-annihilation.",
  "Social media has degenerated into a deafening cacophony of groups signaling and repeating their shared myths.",
  "Ubiquitous streaming cameras with remote storage will eventually end almost all physical criminal activities.",
  "The pace of technological change is accelerating so much that I think we do have the reach for all humans to live a life of abundance in our grasp.",
  "Humans aren’t evolved to worry about everything happening outside of their immediate environment.",
  "Specific knowledge can’t be taught, but can be learned.",
  "Giving your kids everything prevents them from finding themselves.",
  "If you’re struggling through a subject, unless you need it for graduation, drop it. Go learn something that you want to learn.",
  "Basically the library was my after school center.",
  "Study microeconomics, game theory, psychology, persuasion, ethics, mathematics, and computers.",
  "I don’t [try to stay focused]. I follow my interest.",
  "The only way to truly learn something is by doing it. Yes, listen to guidance. But don’t wait.",
  "Spend your time in the company of geniuses, sages, children, and books. (Source)",
  "On learning anything (happiness, losing weight, etc.): You decide it’s important to you. You prioritize it above everything else. You read everything on the topic.",
  "If you learn how to learn, it’s the ultimate meta skill and I believe you can learn how to be healthy, you can learn how to be fit, you can learn how to be happy, you can learn how to have good relationships, you can learn how to be successful.",
  "When you’re memorizing something, it’s an indication that you don’t understand it. You should be able to re-derive anything on the spot and if you can’t, you don’t know it.",
  "Shorter feedback loops means more iterations, and it’s the number of iterations, not the number of hours, that drives learning.",
  "Knowledge is a skyscraper. You can take a shortcut with a fragile foundation of memorization, or build slowly upon a steel frame of understanding.",
  "I use my tweets and other people’s tweets as maxims that help compress my own learnings and be able to recall them.",
  "The overeducated are worse off than the undereducated, for they traded common sense for the illusion of knowledge.",
  "I think learning should be about learning the basics in all the fields and learning them really well over and over.",
  "If the primary purpose of school was education, the Internet should obsolete it. But school is mainly about credentialing.",
  "On his best parenting advice: Love them unconditionally, try not to say “no”, and always reward their innate curiosity.",
  "Identify your strengths and apply them to what you care about. Iterate at the edge of knowledge. Building it will feel like play to you, but look like work to others.",
  "Keeping your intellectual curiosity alive is really important. The only way that’s going to happen is if you learn what you love, if you read what you love, if you do what you love.",
  "If I’m running a grade school curriculum for children, I would probably optimize happiness, nutrition, diet, exercise, “How do you build good habits?”, “How do you break bad habits?”, “How do you have good relationships?”, “How do you find your spouse?”, meditation, “How do you build basic skills, not memorize lots of facts?”, “What kinds of books should you read?”",
  "Your most important skill isn’t even what you majored in or even what you studied, it’s just knowing how to learn. (Related: how to learn faster)",
  "What’s really important is to develop a love of learning. That is more important than anything else; it’s more important than what you learn. It’s more important than what school you go to, and it’s more important than what job you have.",
  "I think every child has the love of learning. Children are learning machines. They stop learning either because their ego gets too big and thinks that it knows everything or that it thinks it doesn’t needs to know more. Or because society somehow fails them.",
  "Knowing something about everything allows you to navigate life. But knowing everything about something can show you what depth has to offer. It also gives you a joy and appreciation for what life has to offer. (See also: )",
  "There’s a whole set of things we don’t even bother trying to teach. We don’t teach nutrition. We don’t teach cooking. We don’t teach how to be in happy, positive relationships. We don’t teach how to keep your body healthy and fit. We just say sports. We don’t teach happiness. We don’t teach meditation.",
  "I think the smartest people can explain things to a child. If you can’t explain it to a child, then you don’t know it.",
  "The bigger problem this generation will face is adult education, not child education",
  "Instead of memorizing, understand the basics so you can derive answers.",
  "Read what you love until you love to read.",
  "The Internet is the best school ever created. The best peers are on the Internet. The best books are on the Internet. The best teachers are on the Internet.",
  "Study logic and math, because once you’ve mastered them, you won’t fear any book.",
  "The genuine love for reading itself, when cultivated, is a superpower.",
  "Free education is abundant, all over the Internet. It’s the desire to learn that’s scarce. Cultivate that desire by reading what you want.",
  "When I find something really interesting, I’ll reflect on it, research it, and then when I’m bored of it, I’ll drop it or I’ll flip to another book.",
  "The best way to read is to: Pick up a lot of books. Start reading them all. Put down any book instantly that doesn’t grab you. And just keep going until you find something that speaks to you.",
  "The real education begins in the library, it begins with books. If you can learn to like to read, you never need to go to school.",
  "At any given time I’m reading somewhere between ten and 20 books. I’m flipping through them. If the book is getting a little boring, I’ll skip ahead.",
  "Sometimes I’ll start reading a book in the middle because some paragraph caught my eye and I’ll just continue from there.",
  "I feel no obligation whatsoever to finish the book. If at some point I decide the book is boring, or if it’s got pieces of it that are incorrect so now I can’t trust the rest of the information in there, I just delete it.",
  "Sometimes people wrap long books around simple ideas.",
  "I no longer track books read or even care about books read. It’s about understanding concepts.",
  "On if he has mentors: No, learn bits and pieces from everyone. I mostly learned from books.",
  "I don’t read anymore to complete books. I read to satisfy my genuine intellectual curiosity.",
  "The best founders I know listen to and read everyone, but then they ignore everyone and make up their own mind.",
  "If they wrote it to make money, don’t read it.",
  "I don’t have time is just saying it’s not a priority.",
  "Time is the ultimate currency and I should have been more tight fisted with it.",
  "I think most of life is about searching, it’s not about doing. People spend too much time doing and not enough time thinking about what they should be doing.",
  "Say no to more things to protect your time because it’s very precious. On your dying day, you will give everything you have for another day.",
  "You literally have to free up your time because the world will assault you with its own agendas. You have to say no to everything and free up your time so you can solve the important problems.",
  "Ruminating on the past is largely a waste of time. It’s illusory.",
  "Schedules are so overrated. I wish I could have a completely unscheduled life; that would be something nice to shoot for.",
  "My only schedule is my daily morning workout, and even that I’m not perfect on it, but other than that I try to be as unscheduled as possible because I want to be free.",
  "I think it’s really worth – whenever you can in life, if you have the choice – optimizing for independence rather than optimizing for pay.",
  "What you want to do in life is, you want to be in control of your time, so you want to get into a leveraged job, and then you want to get into one where you control your own time and you’re tracked on the outputs.",
  "If they pay you what you’re worth, then you can get your time back, and if you get your time back, then you can be hyperefficient",
  "I have no time for short-term things: dinners with people I won’t see again, tedious ceremonies to please tedious people, traveling to places that I wouldn’t go to on vacation.",
  "Success is the enemy of learning. It can deprive you of the time and the incentive to start over. Beginner’s mind also needs beginner’s time.",
  "Be ruthless about not scheduling things. You will have to disappoint people, but when they want your time, that’s their problem, not yours.",
  "We spend so much time in relationships. The average relationship probably lasts a couple years. We spend very little time deciding which relationship to get into. We spend so much time in a job, but we spend so little time deciding which job to get into. Choosing what city to live in can almost completely determine the trajectory of your life, but we spend so little time trying to figure out what city to live in.",
  "I was very selfish with my time and I probably had the most productive year of my life.",
  "I don’t believe in work time. I just believe in time and you can spend it doing whatever you want to do.",
  "A clear mind, leads to better judgement, leads to better outcome.",
  "You can have the mind or you can have the moment.",
  "A busy mind can often rob you of peace of mind. The peace that we seek is not peace of mind, it’s peace from mind.",
  "You want to rest your mind. You want to learn how to settle into your mind. Now, I look forward to solitary confinement. You leave me alone for a day, it will be the happiest day I’ve had in awhile. That is a superpower that I think everybody can attain.",
  "What I find is that 90 percent of thoughts that I have are fear. 90 percent are fear based. The other 10 percent are probably desire based.",
  "You have to get out of that relative mindset because if you get into that relative mindset, you’re always going to hate people who do better than you, you’re always going to be jealous, you’re going to be envious of them.",
  "“Artists” calling for censorship don’t know what art is. “Scientists” citing consensus don’t know what science is. “Teachers” indoctrinating students don’t know what teaching is. “Journalists” parroting propaganda don’t know what reporting is. Programming us all day long.",
  "The fewer desires I can have, the more I can accept the current state of things, the less my mind is moving because the mind really exists in motion towards the future or the past.",
  "Everything is perfect exactly the way it is. It is only in our particular minds that we’re unhappy or not happy and things are perfect or imperfect because of what we desire.",
  "The advantage of meditation is not that you’re suddenly going to gain the superpower to control your internal state, it’s that you will recognize just how out of control your mind is.",
  "On the mind: It is like a monkey flinging feces, that’s running around the room, making trouble, shouting, breaking things. It’s completely uncontrollable. It’s an out-of-control mad person.",
  "You have to see this mad creature in operation before you feel a certain distaste towards it and you start separating yourself from it. In that separation is liberation.",
  "I think the number one thing that clouds us from being able to see reality is that we have preconceived notions of the way it should be.",
  "A busy mind accelerates the perceived passage of time. Buy more time by cultivating peace of mind.",
  "The clear thinking comes from having time to reflect and to pursue your genuine intellectual curiosity.",
  "If you want to be effective in business, you need a clear, calm, cool, and collected mind.",
  "Love is given, not received.",
  "True, unconditional love, is the province of parents and saints.",
  "Love people more. […] It turns out you can give love. It’s free to give. […] On a long enough time scale, the universe sends it back your way.",
  "Just be you and wait for the people who want that.",
  "When you have children, you learn to love something more than you love yourself, and you can talk about that all day long, but you have never had that feeling until you’ve had a child.",
  "It’s not something you can buy. No amount of money or power will bring you true, unconditional love.",
  "If you don’t love yourself, who will?",
  "We’re not really here that long, and we don’t really matter that much. Nothing that we do lasts. Eventually, you will fade. Your works will fade. Your children will fade. Your thoughts will fade. These planets will fade. This sun will fade. It will all be gone."
]